def get_calc(l):
    """
    Создать строку равную третьему символу введенной строки
    """
    output = l[2]
    return output

l = input("Enter string:")

print(get_calc(l))